In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
import webbrowser
link = 'https://www.tiobe.com/tiobe-index/'
webbrowser.open(link)

True

In [4]:
df = pd.read_clipboard()

In [5]:
df

   Jul 2019   Jul 2018  Change  Programming Language  Ratings   Change
0          1          1     NaN                  Java  15.058%  -1.08%
1          2          2     NaN                     C  14.211%  -0.45%
2          3          4  change                Python   9.260%  +2.90%
3          4          3  change                   C++   6.705%  -0.91%
4          5          6  change                    C#   4.365%  +0.57%
5          6          5  change     Visual Basic .NET   4.208%  -0.04%
6          7          8  change            JavaScript   2.304%  -0.53%
7          8          7  change                   PHP   2.167%  -0.67%
8          9          9     NaN                   SQL   1.977%  -0.36%

In [6]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['Jul 2019 ', 'Jul 2018 ', 'Change ', 'Programming Language ',
       'Ratings ', 'Change'],
      dtype='object')

In [17]:
df.Change

0    -1.08%
1    -0.45%
2    +2.90%
3    -0.91%
4    +0.57%
5    -0.04%
6    -0.53%
7    -0.67%
8    -0.36%
Name: Change, dtype: object

In [18]:
df_new = DataFrame(df, columns=['Programming Language ','Jul 2019 '])

In [19]:
df_new

  Programming Language   Jul 2019
0                  Java          1
1                     C          2
2                Python          3
3                   C++          4
4                    C#          5
5     Visual Basic .NET          6
6            JavaScript          7
7                   PHP          8
8                   SQL          9

In [21]:
type(df['Jul 2019 '])

pandas.core.series.Series

In [22]:
df_new1 = DataFrame(df, columns=['Programming Language ','Jul 2019 ','Jul 2017 '])

In [23]:
df_new1

  Programming Language   Jul 2019   Jul 2017
0                  Java          1        NaN
1                     C          2        NaN
2                Python          3        NaN
3                   C++          4        NaN
4                    C#          5        NaN
5     Visual Basic .NET          6        NaN
6            JavaScript          7        NaN
7                   PHP          8        NaN
8                   SQL          9        NaN

In [25]:
df_new1['Jul 2017 '] = range(0,9)

In [26]:
df_new1

  Programming Language   Jul 2019   Jul 2017
0                  Java          1          0
1                     C          2          1
2                Python          3          2
3                   C++          4          3
4                    C#          5          4
5     Visual Basic .NET          6          5
6            JavaScript          7          6
7                   PHP          8          7
8                   SQL          9          8

In [27]:
df_new1['Jul 2017 '] = np.arange(0,9)

In [28]:
df_new1

  Programming Language   Jul 2019   Jul 2017
0                  Java          1          0
1                     C          2          1
2                Python          3          2
3                   C++          4          3
4                    C#          5          4
5     Visual Basic .NET          6          5
6            JavaScript          7          6
7                   PHP          8          7
8                   SQL          9          8

In [29]:
df_new1['Jul 2017 '] = pd.Series(np.arange(0,9))

In [30]:
df_new1

  Programming Language   Jul 2019   Jul 2017
0                  Java          1          0
1                     C          2          1
2                Python          3          2
3                   C++          4          3
4                    C#          5          4
5     Visual Basic .NET          6          5
6            JavaScript          7          6
7                   PHP          8          7
8                   SQL          9          8

In [31]:
df_new1['Jul 2017 '] = pd.Series([100,200], index=[1,2])

In [32]:
df_new1

  Programming Language   Jul 2019   Jul 2017
0                  Java          1        NaN
1                     C          2      100.0
2                Python          3      200.0
3                   C++          4        NaN
4                    C#          5        NaN
5     Visual Basic .NET          6        NaN
6            JavaScript          7        NaN
7                   PHP          8        NaN
8                   SQL          9        NaN